Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The externally-accessible token of the OIDC provider and other endpoints might have different HTTP(S) URLs compared to the URLs that are auto-discovered or configured relative to the `quarkus.oidc.auth-server-url` internal URL. For example, suppose your SPA acquires a token from an external token endpoint address and sends it to Quarkus as a bearer token. In that case, the endpoint might report an issuer verification failure.
ja_jp: OIDC プロバイダーおよびその他のエンドポイントの外部からアクセス可能なトークンは、自動検出された URL や `quarkus.oidc.auth-server-url` 内部 URL を基準に設定された URL とは異なる HTTP(S) URL を持っている可能性があります。 たとえば、SPA が外部トークンエンドポイントアドレスからトークンを取得し、それをベアラートークンとして Quarkus に送信するとします。 その場合、エンドポイントから発行者の検証の失敗が報告される可能性があります。

source: The extra `description` argument is new: without it the data only appears in the Dev UI. Once supplied, the `jokes` data becomes an MCP resource, however, by default this resource will be disabled. You can change the default by passing in `true` as another parameter after description, that will change this default to be enabled. Users can change this in Dev UI anyway, so this is just a sensible default.
ja_jp: 追加の `description` 引数は新しいものです。これがない場合、データは Dev UI にのみ表示されます。指定されると、`jokes` データは MCP リソースになりますが、デフォルトではこのリソースは無効になっています。説明の後の別のパラメーターとして `true` を渡すことで、デフォルトを有効に変更できます。ユーザーはどのみち Dev UI でこれを変更できるため、これは単に適切なデフォルト設定にすぎません。

source: The extra description of the client version. The length cannot exceed 64.
ja_jp: クライアント・バージョンの追加説明。長さは64を超えることはできません。

source: The fact is that the Core had become very big (1000+ Maven modules) and it was the barrier of entry was high, be it to contribute to the Core itself or to one of the smaller extensions inside it.
ja_jp: 事実、コアは非常に大きくなっており（1000以上のMavenモジュール）、コア自体に貢献するにしても、コアの中の小さなエクステンションに貢献するにしても、参入障壁が高かったのです。

source: The facts inserted will be inserted into a `DataStore`, a type-safe entry point. To make everything work, we need to define both the RuleUnit and the DataStore.
ja_jp: 挿入されたファクトは、タイプセーフのエントリーポイントである `DataStore` に挿入されます。すべてを機能させるには、RuleUnitとDataStoreの両方を定義する必要があります。

source: The facts will be inserted into a `DataStore`, a type-safe entry point. To make everything work, we need to define both the RuleUnit and the DataStore.
ja_jp: ファクトは、タイプセーフなエントリーポイントである `DataStore` に挿入されます。すべてが機能するようにするには、RuleUnit と DataStore の両方を定義する必要があります。

source: The failure strategy to apply when a RabbitMQ message is nacked. Accepted values are `fail`, `accept`, `reject` (default) Type: _string_
ja_jp: RabbitMQ メッセージがnackされた場合に適用する失敗戦略。承認される値は、 `fail`、 `accept`、 `reject` (デフォルト) です。 Type: _string_

source: The fallback method is required to have the same parameters as the original method.
ja_jp: フォールバックメソッドには、元のメソッドと同じパラメータが必要です。

source: The feature can be explicitly disabled per task (enabled by default). The default behavior can change by setting the following property to `false`:
ja_jp: 機能はタスクごとに明示的に無効にすることができます（デフォルトでは有効）。 デフォルトの動作は、次のプロパティを `false` に設定することで変更できます：

source: The feature can be explictily disabled per task (enabled by default). The default behavior can change by setting the following property to `false`:
ja_jp: この機能はタスクごとに明示的に無効にすることができます（デフォルトでは有効）。デフォルトの動作は、次のプロパティを `false` に設定することで変更できます：

source: The feature is enabled by default and can be globally disabled, using:
ja_jp: この機能はデフォルトで有効になっており、以下を使用してグローバルに無効にすることができます:

source: The feature is only available for `@QuarkusTest` and will **not** work on a `@NativeImageTest` or `@QuarkusIntegrationTest`.
ja_jp: この機能は `@QuarkusTest` でのみ利用可能で、 `@NativeImageTest` では動作 *しません* 。

source: The feature is only available for `@QuarkusTest` and will **not** work on a `@NativeImageTest`.
ja_jp: この機能は `@QuarkusTest` でのみ利用可能で、 `@NativeImageTest` では動作 *しません*。

source: The feature is only available for `@QuarkusTest` and will **not** work on a `@QuarkusIntegrationTest`.
ja_jp: この機能は `@QuarkusTest` でのみ利用可能で、 `@QuarkusIntegrationTest` では動作 *しません* 。

source: The feature is untested on Windows environments
ja_jp: この機能は Windows 環境ではテストされていません

source: The feature name should also map to a label in the extension's `devtools/common/src/main/filtered/extensions.json` entry so that the feature name displayed by the startup line matches a label that one can use to select the extension when creating a project using the Quarkus maven plugin as shown in this example taken from the xref:rest-json.adoc[Writing JSON REST Services] guide where the `rest-jackson` feature is referenced:
ja_jp: この機能名は、エクステンションの `devtools/common/src/main/filtered/extensions.json` エントリーのラベルにもマップする必要があります。 これにより、起動時に表示される機能名が、Quarkus Maven プラグインを使用してプロジェクトを作成する際にエクステンションを選択するために使用できるラベルと一致します。以下の例は、xref:rest-json.adoc[JSON REST Services の作成] ガイドから引用したもので、 `rest-jackson` 機能が参照されています。

source: The feature name should also map to a label in the extension's `devtools/common/src/main/filtered/extensions.json` entry so that the feature name displayed by the startup line matches a label that one can use to select the extension when creating a project using the Quarkus maven plugin as shown in this example taken from the xref:rest-json.adoc[Writing JSON REST Services] guide where the `resteasy-reactive-jackson` feature is referenced:
ja_jp: 機能名は、エクステンションの `devtools/common/src/main/filtered/extensions.json` エントリーのラベルにもマップする必要があります。これにより、起動行によって表示される機能名が、エクステンションの選択に使用できるラベルと一致するようになります。 `resteasy-reactive-jackson` 機能が参照されている xref:rest-json.adoc[JSON RESTサービスの実装] ガイドから抜粋したこの例に示すように、Quarkus maven プラグインを使用してプロジェクトを作成します。

source: The feature name should also map to a label in the extension's `devtools/common/src/main/filtered/extensions.json` entry so that the feature name displayed by the startup line matches a label that one can used to select the extension when creating a project using the Quarkus maven plugin as shown in this example taken from the xref:rest-json.adoc[Writing JSON REST Services] guide where the `resteasy-jackson` feature is referenced:
ja_jp: この機能名は、エクステンションの `devtools/common/src/main/filtered/extensions.json` エントリのラベルにも対応する必要があります。 起動時に表示される機能名が、プロジェクト作成時にエクステンションを選択するためのラベルと一致するようにします。 これにより、起動時に表示される機能名が、Quarkus maven プラグインを使用してプロジェクトを作成するときにエクステンションを選択するために使用するラベルと一致します： `resteasy-jackson` 機能が参照されているxref:rest-json.adoc[Writing JSON REST Services]ガイドから引用したこの例のように、Quarkus mavenプラグインを使用してください：

source: The feature requires JDK 25 or newer.
ja_jp: この機能には JDK 25 以降が必要です。

source: The featured examples use `com.example` as a logging category.
ja_jp: 特集の例では、 `com.example` をロギング・カテゴリーとして使用しています。

source: The field use to manipulate keys
ja_jp: キー操作のために使用するフィールド

source: The field use to manipulate the counter
ja_jp: カウンター操作のために使用するフィールド

source: The fields annotated with `@Inject` and `@InjectMock` are injected after a test instance is created. The parameters of a test method for which a matching bean exists are resolved (unless annotated with `@io.quarkus.test.component.SkipInject` or `@org.mockito.Mock`) when a test method is executed. Finally, the CDI request context is activated and terminated per each test method.
ja_jp: `@Inject` および `@InjectMock` でアノテーションが付けられたフィールドは、テストインスタンスが作成された後に注入されます。 一致する Bean が存在するテストメソッドのパラメーターは、テストメソッドの実行時に解決されます (`@io.quarkus.test.component.SkipInject` または `@org.mockito.Mock` でアノテーションが付けられている場合を除く)。 最後に、CDI リクエストコンテキストが各テストメソッドごとにアクティブ化され、終了します。

source: The file `META-INF/orm.xml` will always be included by default, if it exists in the classpath.
ja_jp: `META-INF/orm.xml` ファイルがクラスパスに存在する場合は、常にデフォルトでインクルードされます。

source: The file format is very simple: each line represents either a key/value pair with the equals sign used as a separator or a comment (line starts with `#`). Blank lines are ignored. Keys are _mapped to method names_ from the corresponding message bundle interface. Values represent the templates normally defined by `io.quarkus.qute.i18n.Message#value()`. A value may be spread out across several adjacent normal lines. In such case, the line terminator must be escaped with a backslash character `\`. The behavior is very similar to the behavior of the `java.util.Properties.load(Reader)` method.
ja_jp: ファイル形式は非常にシンプルで、各行は、等号を区切り文字として使用するキーと値のペア、またはコメント (行頭は `#`) のいずれかを表します。空白行は無視されます。キーは、対応するメッセージバンドルインターフェースから _メソッド名にマッピング_ されます。値は通常、`io.quarkus.qute.i18n.Message#value()` で定義されるテンプレートを表します。値は、隣接する複数の通常の行にまたがっていてもかまいません。その場合、行の終端はバックスラッシュ文字 `\` でエスケープする必要があります。この動作は、`java.util.Properties.load(Reader)` メソッドの動作と非常によく似ています。

source: The file log handler is disabled by default. It outputs all log events to a file on the application's host. It supports log file rotation.
ja_jp: ファイルログハンドラーはデフォルトでは無効になっています。すべてのログイベントをアプリケーションのホスト上のファイルに出力します。ログファイルのローテーションをサポートしています。

source: The file name located under the `resources` folder that contains the configuration of the 'books' cache
ja_jp: 'books' キャッシュの設定を含む `resources` フォルダー下のファイル名

source: The file name should reflect the document type:
ja_jp: ファイル名は、ドキュメントの種類を反映させる必要があります:

source: The file name should reflect the type of document:
ja_jp: ファイル名は、ドキュメントの種類を反映したものにします:

source: The file or folder "/path/from" from the local machine will be accessible at "/container/to" in the container.
ja_jp: ローカルマシンのファイルやフォルダ "/path/from" は、コンテナの "/container/to" でアクセスできるようになります。

source: The files are reloaded from the same location as they were initially loaded from. If there is no content change, the reloading is a no-op. It the reloading fails, the server will continue to use the previous certificates.
ja_jp: ファイルは最初に読み込まれたのと同じ場所から再読み込みされます。 内容に変更がない場合、リロードは失敗します。 リロードに失敗した場合、サーバは以前の証明書を使い続けます。

source: The files you download are not automatically removed and can take up a lot of disk space. Consider removing the files when you are done working with them.
ja_jp: ダウンロードしたファイルは自動的に削除されず、多くのディスク領域を占有する可能性があります。作業が終わったら、ファイルを削除することを検討してください。

source: The filter executes (eagerly) at application startup.
ja_jp: フィルターはアプリケーションの起動時に (先行して) 実行されます。

source: The filter executes at build time.
ja_jp: フィルターはビルド時に実行されます。

source: The filter executes each time the OpenAPI document is requested.
ja_jp: フィルターは OpenAPI ドキュメントが要求されるたびに実行されます。

source: The filter intercepts all incoming HTTP requests to identify cross-origin requests and applies the configured policy. The filter then adds CORS headers to the HTTP response, informing browsers about allowed origins and access parameters. For preflight requests, the filter returns an HTTP response immediately. For regular CORS requests, the filter denies access with an HTTP 403 status if the request violates the configured policy; otherwise, the filter forwards the request to the destination if the policy allows it.
ja_jp: フィルターは、すべての受信 HTTP リクエストをインターセプトしてクロスオリジンリクエストを識別し、設定されたポリシーを適用します。 次に、フィルターは HTTP 応答に CORS ヘッダーを追加し、許可されたオリジンとアクセスパラメーターについてブラウザーに通知します。 プリフライトリクエストの場合、フィルターは HTTP 応答を直ちに返します。 通常の CORS リクエストの場合、リクエストが設定されたポリシーに違反すると、フィルターは HTTP 403 ステータスでアクセスを拒否します。それ以外の場合、ポリシーで許可されていれば、フィルターはリクエストを宛先に転送します。

source: The filter is likely required to call the `next()` method to continue the chain.
ja_jp: フィルターが `next()`メソッドを呼び出さなければ、チェーンを継続できない可能性があります。

source: The final (and optional) step is to customize which specific Cassandra metrics you would like the Cassandra client to track. Several metrics can be tracked; if you skip this step, a default set of useful metrics will be automatically tracked.
ja_jp: 最後の手順 (任意) で、Cassandra クライアントに追跡させる特定の Cassandra メトリクスをカスタマイズします。複数のメトリクスを追跡できますが、この手順をスキップすると、有用なメトリクスのデフォルトセットが自動的に追跡されます。

source: The final _magic touch_
ja_jp: 最後の _マジックタッチ_

source: The final bean we will create ties together all the previous beans. Create a `src/main/java/org/acme/spring/di/GreeterBean.java` file and copy the following content:
ja_jp: 最後に作成するBeanは、これまでのBeanをすべて結びつけるものです。 `src/main/java/org/acme/spring/di/GreeterBean.java` ファイルを作成し、以下の内容をコピーします:

source: The final configuration is the aggregation of the properties defined by all these sources. A configuration property lookup starts by the highest ordinal configuration source available and works it way down to other sources until a match is found. This means that any configuration property may override a value just by setting a different value in a higher ordinal config source. For example, a property configured using an environment property overrides the value provided using the `application.properties` file.
ja_jp: 最終的な設定は、これらすべてのソースによって定義されたプロパティーの集約です。設定プロパティーのルックアップは、使用可能な最も高い序数の設定ソースから始まり、一致するものが見つかるまで他のソースに下がっていきます。つまり、上位の序数設定ソースに別の値を設定するだけで、設定プロパティーが値をオーバーライドする可能性があります。たとえば、環境プロパティーを使用して設定されたプロパティーは、 `application.properties` ファイルを使用して提供された値をオーバーライドします。

source: The final order of business is to make the configuration file known to the `native-image` executable by adding the proper configuration to `application.properties`:
ja_jp: 最後にやるべきことは、 `application.properties` に適切な設定を追加して、設定ファイルを `native-image` 実行可能ファイルに知らせることです。

source: The final order of business is to make the configuration file known to the `native-image` executable. To do that, place the configuration file under the `src/main/resources/META-INF/native-image/<group-id>/<artifact-id>` folder. This way they will be automatically parsed by the native build, without additional configuration.
ja_jp: 最後の作業として、設定ファイルを `native-image` 実行可能ファイルに認識させます。 そのためには、設定ファイルを `src/main/resources/META-INF/native-image/<group-id>/<artifact-id> フォルダーに配置します。 こうすることで、追加の設定なしでネイティブビルドによって自動的に解析されます。

source: The final value is always rounded to full second.
ja_jp: 最終的な値は常に1秒単位で丸められます。

source: The final version of the `MainVerticle` Java class looks like this:
ja_jp: 最終的な `MainVerticle` Java クラスは以下のようになります。

source: The first application, the _producer_, will let the user request some quotes over a HTTP endpoint. For each quote request a random identifier is generated and returned to the user, to mark the quote request as _pending_. At the same time, the generated request id is sent over a Kafka topic `quote-requests`.
ja_jp: 最初のアプリケーションである _プロデューサー_ は、ユーザーが HTTP エンドポイントを介していくつかの見積りをリクエストできるようにします。見積りリクエストごとにランダムな識別子が生成されてユーザーに返され、見積りリクエストを _保留_ としてマークします。同時に、生成されたリクエスト ID は Kafka トピック `quote-requests` を介して送信されます。

source: The first application, the _producer_, will let the user request some quotes over an HTTP endpoint. For each quote request a random identifier is generated and returned to the user, to mark the quote request as _pending_. At the same time, the generated request id is sent over a Kafka topic `quote-requests`.
ja_jp: 1つ目のアプリケーションである _プロデューサー_ は、ユーザーが HTTP エンドポイントを介していくつかの見積をリクエストできるようにします。見積リクエストごとにランダムな識別子が生成されてユーザーに返され、見積リクエストを _保留_ としてマークします。同時に、生成されたリクエスト ID は Kafka トピック `quote-requests` を介して送信されます。

source: The first application, the _producer_, will let the user request some quotes over an HTTP endpoint. For each quote request a random identifier is generated and returned to the user, to mark the quote request as _pending_. At the same time, the generated request id is sent over a Pulsar topic `quote-requests`.
ja_jp: 1つ目のアプリケーションである _プロデューサー_ は、ユーザーが HTTP エンドポイントを介していくつかの見積をリクエストできるようにします。見積リクエストごとにランダムな識別子が生成されてユーザーに返され、見積リクエストを _保留_ としてマークします。同時に、生成されたリクエスト ID は Pulsar トピック `quote-requests` を介して送信されます。

source: The first application, the `producer`, will let the user request some quotes over an HTTP endpoint. For each quote request, a random identifier is generated and returned to the user, to put the quote request on _pending_. At the same time the generated request id is sent over the `quote-requests` queue.
ja_jp: 最初のアプリケーションである `producer` は、ユーザーが HTTP エンドポイントを介していくつかの見積りをリクエストできるようにします。見積りリクエストごとにランダムな識別子が生成されてユーザーに返され、見積りリクエストを _pending_ とします。同時に、生成されたリクエスト ID は、 `quote-requests` キューに送信されます。

source: The first application, the `producer`, will let the user request some quotes over an HTTP endpoint. For each quote request, a random identifier is generated and returned to the user, to put the quote request on _pending_. At the same time the generated request id is sent to the `quote-requests` exchange.
ja_jp: 最初のアプリケーションである `producer` では、ユーザーが HTTP エンドポイントを介していくつかの見積を要求することができます。各見積要求に対して、ランダムな識別子が生成され、ユーザーに返され、見積要求が _pending_ されます。同時に、生成されたリクエストIDは、 `quote-requests` のエクスチェンジに送信されます。

source: The first application, the `producer`, will let the user request some quotes over an HTTP endpoint. For each quote request, a random identifier is generated and returned to the user, to put the quote request on _pending_. At the same time, the generated request id is sent over the `quote-requests` queue.
ja_jp: 最初のアプリケーションである `producer` は、ユーザーが HTTP エンドポイントを介していくつかの見積りをリクエストできるようにします。見積りリクエストごとにランダムな識別子が生成されてユーザーに返され、見積りリクエストを _pending_ とします。同時に、生成されたリクエスト ID は `quote-requests` キューに送信されます。

source: The first approach is by providing the properties within the `src/main/resources/application.properties` file:
ja_jp: 最初のアプローチは、 `src/main/resources/application.properties` ファイル内でプロパティーを提供することです。

source: The first choice is to use `quarkus.hibernate-orm.database.generation=drop-and-create` in conjunction with `import.sql`.
ja_jp: 1つ目の選択肢は、 `quarkus.hibernate-orm.database.generation=drop-and-create` と `import.sql` を併用することです。

source: The first choice is to use `quarkus.hibernate-orm.schema-management.strategy=drop-and-create` in conjunction with `import.sql`.
ja_jp: 1 つ目の選択肢は、 `quarkus.hibernate-orm.schema-management.strategy=drop-and-create` を `import.sql` と併用することです。

source: The first configuration is the default tenant configuration that should be used when the tenant can not be inferred from the request. This configuration is using a Keycloak instance to authenticate users.
ja_jp: 最初の設定は、テナントをリクエストから推測できない場合に使用する必要があるデフォルトのテナント設定です。この設定では、Keycloak インスタンスを使用してユーザーを認証しています。

source: The first configuration is the default tenant configuration that should be used when the tenant cannot be inferred from the request. Be aware that a `%prod` profile prefix is used with `quarkus.oidc.auth-server-url` to support testing a multitenant application with Dev Services For Keycloak. This configuration uses a Keycloak instance to authenticate users.
ja_jp: 最初の設定は、リクエストからテナントを推測できない場合に使用するデフォルトのテナント設定です。 %prod` プロファイル接頭辞は、Dev Services For Keycloak を使用したマルチテナントアプリケーションのテストをサポートするために、`quarkus.oidc.auth-server-url` とともに使用される点に注意してください。 この設定では、Keycloak インスタンスを使用してユーザーを認証します。

source: The first function we'll look at is `defaultChain`.
ja_jp: 最初に見る関数は `defaultChain` です。

source: The first important point is that, with Hibernate ORM, in Quarkus, we still build the metadata at runtime. That means we end up reading a lot of annotations at runtime. A long-term effort has already started to improve this situation, but it's a significant undertaking and will take time before we can move metadata building to build time instead.
ja_jp: 最初の重要な点は、Quarkus における Hibernate ORM では、依然として実行時にメタデータを構築しているということです。つまり、実行時に多くのアノテーションを読み込むことになります。この状況を改善するための長期的な取り組みはすでに始まっていますが、これは大規模なプロジェクトであり、メタデータの構築をビルド時に移行できるようになるまでには時間がかかります。

source: The first instrumental pattern consists of transforming the item events you receive. As we have seen in the previous section, it could indicate the successful insertion, or the elements stored in the database.
ja_jp: 最初の計測パターンは、受け取ったアイテムイベントを変換することで構成されています。前節で見たように、挿入が成功したことを示したり、データベースに格納されている要素を示したりします。

source: The first integration point is the use of the `io.quarkus.kubernetes.client.KubernetesConfigCustomizer` interface. When such a bean exists, it allows for arbitrary customizations of the `io.fabric8.kubernetes.client.Config` created by Quarkus (which takes into account the `quarkus.kubernetes-client.*` properties).
ja_jp: 最初の統合ポイントは、 `io.quarkus.kubernetes.client.KubernetesConfigCustomizer` インターフェイスの使用です。このようなBeanが存在する場合、Quarkusが作成した `io.fabric8.kubernetes.client.Config` （ `quarkus.kubernetes-client.*` のプロパティを考慮します）を任意にカスタマイズすることができます。

source: The first invocation upon the injected proxy triggers the instantiation of `CoolService`.
ja_jp: 注入されたプロキシーに対する最初の呼び出しは、 `CoolService` のインスタンス化をトリガーします。

source: The first is a very short Java process that does some basic validation and builds the arguments for the second process (in a stock GraalVM distribution, this is executed as native code).
ja_jp: 1番目は非常に短いJavaプロセスで、基本的な検証を行い、2つ目のプロセスのための引数を組み立てます（GraalVMの純正ディストリビューションでは、これはネイティブコードとして実行されます）。

source: The first method is to first configure settings in `application.properties`.
ja_jp: 最初の方法では、最初に `application.properties` を設定します。

source: The first method simply calls begin, does some work and commits it. This created transaction is tied to the CDI request scope, so if it is still active when the request scope is destroyed then it will be automatically rolled back. This removes the need to explicitly catch exceptions and call `rollback`, and acts as a safety net against inadvertent transaction leaks, however it does mean that this can only be used when the request scope is active. The second example in the method calls begin with a timeout option, and then rolls back the transaction.
ja_jp: 最初の方法は、単純に begin を呼び出し、何らかの処理を行い、それをコミットするものです。この作成されたトランザクションはCDIリクエストスコープに関連付けられ、リクエストスコープが破棄されたときにまだアクティブであれば、自動的にロールバックされます。これにより、明示的に例外をキャッチしたり `rollback` を呼び出したりする必要がなくなり、 不用意なトランザクションリークに対するセーフティネットとして機能します。 しかし、これはリクエストスコープがアクティブであるときにしか使えないということになります。メソッド呼び出しの2番目の例は、タイムアウトオプションで開始し、トランザクションをロールバックします。

source: The first module of the project is selected. For single Quarkus projects, it is ok. If you have a multi module Quarkus project, you can change the module to test. You can also specify a Quarkus profile to use (dev is the default) and environment variables (using the notation VARNAME=varvalue, separated by semicolon)
ja_jp: プロジェクトの最初のモジュールが選択されます。単一のQuarkusプロジェクトの場合は、これでOKです。複数モジュールのQuarkusプロジェクトの場合は、モジュールをtestに変更することができます。また、使用するQuarkusプロファイル（devがデフォルト）と環境変数（VARNAME=varvalueの表記で、セミコロンで区切る）を指定することもできます。

source: The first non-null locale returned by a `LocaleResolver` is the one resolved.
ja_jp: `LocaleResolver` が最初に返した非 NULL ロケールに解決されます。

source: The first order of business is to instruct Quarkus to generate Knative resources by setting:
ja_jp: まず最初にQuarkusの設定でKnativeのリソースを生成するように指示します。

source: The first paragraph in the main body is treated as the abstract, also referred to as the preamble. Add a short description that helps your audience quickly find and understand the purpose and intent of the page. The first sentence of the abstract provides a summary and gets automatically added to the tile on the link:https://quarkus.io/guides/[Quarkus guides homepage].
ja_jp: 本文の最初の段落は要約として扱われ、プリアンブルとも呼ばれます。閲覧者がページの目的や意図をすぐに見つけ、理解できるような短い説明を追加します。要約の最初の文はサマリーとなり、 link:https://quarkus.io/guides/[Quarkusガイドのホームページ] のタイルに自動的に追加されます。

source: The first part of the expression is always resolved against the <<current_context_object, current context object>>. If no result is found for the first part it's resolved against the parent context object (if available). For an expression that starts with a namespace the current context object is found using all the available ``NamespaceResolver``s. For an expression that does not start with a namespace the current context object is *derived from the position* of the tag. All other parts of an expression are resolved using all ``ValueResolver``s against the result of the previous resolution.
ja_jp: 式の最初の部分は、常に link:#current_context_object[カレントコンテキストオブジェクト] に対して解決されます。最初の部分の結果が見つからない場合は、(利用可能な場合) 親コンテキストオブジェクトに対して解決されます。名前空間で始まる式の場合、カレントコンテキストオブジェクトは、利用可能なすべての `NamespaceResolver` を使用して検出されます。名前空間で始まらない式の場合、現在のコンテキストオブジェクトはタグの *位置から派生し* ます。式の他のすべての部分は、前の解決結果に対してすべての `ValueResolver` を使用して解決されます。
